In [1]:
import pandas as pd
import numpy as np

##### Series

In [2]:
s = pd.Series([45,22,17,5,33,16,85])

In [3]:
s

0    45
1    22
2    17
3     5
4    33
5    16
6    85
dtype: int64

In [4]:
s = pd.Series([45,22,17,5,33,16,85], dtype = np.int8)

In [5]:
s

0    45
1    22
2    17
3     5
4    33
5    16
6    85
dtype: int8

In [6]:
s[4] = 99
s

0    45
1    22
2    17
3     5
4    99
5    16
6    85
dtype: int8

In [7]:
type(s)

pandas.core.series.Series

In [8]:
s.dtype

dtype('int8')

In [9]:
s.shape

(7,)

In [10]:
s.size

7

In [11]:
s.values

array([45, 22, 17,  5, 99, 16, 85], dtype=int8)

##### Dataframes

In [12]:
r = pd.Series([1,2,3,4,5])
n = pd.Series(['nitin','rajan', 'rani', 'priya', 'manoj'])
m = pd.Series([56.78, 76.23 , 67.89, 77.45, 71.34])

In [13]:
df = pd.DataFrame({'roll':r, 'name': n, 'marks': m})

In [14]:
df

   roll   name  marks
0     1  nitin  56.78
1     2  rajan  76.23
2     3   rani  67.89
3     4  priya  77.45
4     5  manoj  71.34

In [15]:
type(df)

pandas.core.frame.DataFrame

In [16]:
df.dtypes

roll       int64
name      object
marks    float64
dtype: object

In [17]:

df.size

15

In [18]:
df.shape

(5, 3)

In [19]:
# https://mitu.co.in/dataset
# Download all the files whose name starts with students*
# Store in current working directory in folder datsets/

##### Load the data

In [20]:
df = pd.read_csv('datasets/student.csv')

In [21]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [22]:
type(df)

pandas.core.frame.DataFrame

In [23]:
df1 = pd.read_csv('datasets/student1.csv')

In [24]:
df1

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [25]:
df1 = pd.read_csv('datasets/student1.csv', names=['A','B','c','D','E'])

In [26]:
df1

    A        B   c      D   E
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [27]:
None

In [28]:
df1 = pd.read_csv('datasets/student1.csv', names=None)

In [29]:
df1

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [30]:
df1 = pd.read_csv('datasets/student1.csv', header=None)

In [31]:
df1

    0        1   2      3   4
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [32]:
df3 = pd.read_csv('datasets/student3.tsv')

###

In [33]:
df3

  roll\tname\tclass\tmarks\tage
0        1\tanil\tTE\t56.77\t22
1        2\tamit\tTE\t59.77\t21
2      3\taniket\tBE\t76.88\t19
3     4\tajinkya\tTE\t69.66\t20
4        5\tasha\tTE\t63.28\t20
5      6\tayesha\tBE\t49.55\t20
6        7\tamar\tBE\t65.34\t19
7       8\tamita\tBE\t68.33\t23
8        9\tamol\tTE\t56.75\t20
9      10\tanmol\tBE\t78.66\t21

In [34]:
df3 = pd.read_csv('datasets/student3.tsv', sep='\t')
df3

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [35]:
df4 = pd.read_csv('https://raw.githubusercontent.com/mwaskom/seaborn-data/master/iris.csv')
df4

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

#####  data

In [37]:
df4.shape

(150, 5)

In [38]:
df4.size

750

In [39]:
type(df4)

pandas.core.frame.DataFrame

In [40]:
df4.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [41]:
df4.T

,0,1,2,3,4,5,6,7,8,9,...,140,141,142,143,144,145,146,147,148,149
sepal_length,5.1,4.9,4.7,4.6,5.0,5.4,4.6,5.0,4.4,4.9,...,6.7,6.9,5.8,6.8,6.7,6.7,6.3,6.5,6.2,5.9
sepal_width,3.5,3.0,3.2,3.1,3.6,3.9,3.4,3.4,2.9,3.1,...,3.1,3.1,2.7,3.2,3.3,3.0,2.5,3.0,3.4,3.0
petal_length,1.4,1.4,1.3,1.5,1.4,1.7,1.4,1.5,1.4,1.5,...,5.6,5.1,5.1,5.9,5.7,5.2,5.0,5.2,5.4,5.1
petal_width,0.2,0.2,0.2,0.2,0.2,0.4,0.3,0.2,0.2,0.1,...,2.4,2.3,1.9,2.3,2.5,2.3,1.9,2.0,2.3,1.8
species,setosa,setosa,setosa,setosa,setosa,setosa,setosa,setosa,setosa,setosa,...,virginica,virginica,virginica,virginica,virginica,virginica,virginica,virginica,virginica,virginica

In [42]:
df4.head(3)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

In [43]:
df.tail(5)

   roll    name class  marks  age
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

##### Index Based Slicing

In [45]:
x = df.iloc[2:8,1:4]
x

      name class  marks
2   aniket    BE  76.88
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33

In [46]:
df.iloc[2:,1:4]

      name class  marks
2   aniket    BE  76.88
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33
8     amol    TE  56.75
9    anmol    BE  78.66

In [47]:
df.iloc[2:,1:]

      name class  marks  age
2   aniket    BE  76.88   19
3  ajinkya    TE  69.66   20
4     asha    TE  63.28   20
5   ayesha    BE  49.55   20
6     amar    BE  65.34   19
7    amita    BE  68.33   23
8     amol    TE  56.75   20
9    anmol    BE  78.66   21

In [50]:
df.iloc[[3,7,5,9],:]

   roll     name class  marks  age
3     4  ajinkya    TE  69.66   20
7     8    amita    BE  68.33   23
5     6   ayesha    BE  49.55   20
9    10    anmol    BE  78.66   21

In [51]:
df.iloc[[3,7,5,9],[1,2]]

      name class
3  ajinkya    TE
7    amita    BE
5   ayesha    BE
9    anmol    BE

In [52]:
df.iloc[4,:]

roll         5
name      asha
class       TE
marks    63.28
age         20
Name: 4, dtype: object

In [53]:
df.iloc[:,1]

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [54]:
df.iloc[3,1]

'ajinkya'

##### Label based slicing

In [56]:
df.loc[:,'name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [60]:
df.loc[:,['name','marks']]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [61]:
df['name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [63]:
df[['name','marks']]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [64]:
df.name

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [65]:
df.name.values

array(['anil', 'amit', 'aniket', 'ajinkya', 'asha', 'ayesha', 'amar',
       'amita', 'amol', 'anmol'], dtype=object)

In [66]:
df.drop(5)

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [67]:
df.drop([5,4,8])

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21

In [69]:
df.drop('class', axis =1)

   roll     name  marks  age
0     1     anil  56.77   22
1     2     amit  59.77   21
2     3   aniket  76.88   19
3     4  ajinkya  69.66   20
4     5     asha  63.28   20
5     6   ayesha  49.55   20
6     7     amar  65.34   19
7     8    amita  68.33   23
8     9     amol  56.75   20
9    10    anmol  78.66   21

In [70]:
df.drop(['class','age'], axis = 1)

   roll     name  marks
0     1     anil  56.77
1     2     amit  59.77
2     3   aniket  76.88
3     4  ajinkya  69.66
4     5     asha  63.28
5     6   ayesha  49.55
6     7     amar  65.34
7     8    amita  68.33
8     9     amol  56.75
9    10    anmol  78.66

In [71]:
df.shape

(10, 5)

In [72]:
df.drop(['class','age'], axis = 1, inplace = True)

In [73]:
df.shape

(10, 3)

In [74]:
df['marks'].min()

49.55

In [75]:
df['marks'].max()

78.66

In [77]:
df['marks'].mean()

64.499

In [78]:
df['marks'].median()

64.31

In [79]:
df['marks'].std()

9.207178901994535

In [80]:
df.count()

roll     10
name     10
marks    10
dtype: int64

In [81]:
df = pd.read_csv('datasets/student.csv')

In [82]:
df.count()

roll     10
name     10
class    10
marks    10
age      10
dtype: int64

In [83]:
df.info

<bound method DataFrame.info of    roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21>

In [84]:
df.describe()

           roll      marks        age
count  10.00000  10.000000  10.000000
mean    5.50000  64.499000  20.500000
std     3.02765   9.207179   1.269296
min     1.00000  49.550000  19.000000
25%     3.25000  57.520000  20.000000
50%     5.50000  64.310000  20.000000
75%     7.75000  69.327500  21.000000
max    10.00000  78.660000  23.000000

In [85]:
df.max()

roll         10
name     ayesha
class        TE
marks     78.66
age          23
dtype: object

In [87]:
df.min()

roll           1
name     ajinkya
class         BE
marks      49.55
age           19
dtype: object

In [88]:
df.sum()

roll                                                    55
name     anilamitaniketajinkyaashaayeshaamaramitaamolanmol
class                                 TETEBETETEBEBEBETEBE
marks                                               644.99
age                                                    205
dtype: object

In [89]:
df.std(numeric_only=True)

roll     3.027650
marks    9.207179
age      1.269296
dtype: float64

In [90]:
df.sum()

roll                                                    55
name     anilamitaniketajinkyaashaayeshaamaramitaamolanmol
class                                 TETEBETETEBEBEBETEBE
marks                                               644.99
age                                                    205
dtype: object

In [91]:
df.sum(axis=1,numeric_only=True)

0     79.77
1     82.77
2     98.88
3     93.66
4     88.28
5     75.55
6     91.34
7     99.33
8     85.75
9    109.66
dtype: float64

In [92]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [93]:
df['class'].value_counts()

class
TE    5
BE    5
Name: count, dtype: int64

In [94]:
df['age'].value_counts()

age
20    4
21    2
19    2
22    1
23    1
Name: count, dtype: int64

In [95]:
df.sort_values('class', ascending=False)

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
8     9     amol    TE  56.75   20
2     3   aniket    BE  76.88   19
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21

In [104]:
df.sort_values(['class','marks'])

   roll     name class  marks  age
5     6   ayesha    BE  51.05   20
6     7     amar    BE  66.84   19
7     8    amita    BE  69.83   23
2     3   aniket    BE  78.38   19
9    10    anmol    BE  80.16   21
8     9     amol    TE  58.25   20
0     1     anil    TE  58.27   22
1     2     amit    TE  61.27   21
4     5     asha    TE  64.78   20
3     4  ajinkya    TE  71.16   20

##### Coustom column Operation

In [106]:
df['marks'] + 0.5

0    58.77
1    61.77
2    78.88
3    71.66
4    65.28
5    51.55
6    67.34
7    70.33
8    58.75
9    80.66
Name: marks, dtype: float64

In [110]:
df['marks'] = df['marks'] + 0.5

In [111]:
df

   roll     name class  marks  age   cgpa
0     1     anil    TE  59.27   22  5.911
1     2     amit    TE  62.27   21  6.211
2     3   aniket    BE  79.38   19  7.922
3     4  ajinkya    TE  72.16   20  7.200
4     5     asha    TE  65.78   20  6.562
5     6   ayesha    BE  52.05   20  5.189
6     7     amar    BE  67.84   19  6.768
7     8    amita    BE  70.83   23  7.067
8     9     amol    TE  59.25   20  5.909
9    10    anmol    BE  81.16   21  8.100

In [108]:
df['cgpa'] = df['marks'] / 10 + 0.034

In [109]:
df

   roll     name class  marks  age   cgpa
0     1     anil    TE  58.77   22  5.911
1     2     amit    TE  61.77   21  6.211
2     3   aniket    BE  78.88   19  7.922
3     4  ajinkya    TE  71.66   20  7.200
4     5     asha    TE  65.28   20  6.562
5     6   ayesha    BE  51.55   20  5.189
6     7     amar    BE  67.34   19  6.768
7     8    amita    BE  70.33   23  7.067
8     9     amol    TE  58.75   20  5.909
9    10    anmol    BE  80.66   21  8.100

In [112]:
df['first_class'] = df['marks'] > 60
df

   roll     name class  marks  age   cgpa  first_class
0     1     anil    TE  59.27   22  5.911        False
1     2     amit    TE  62.27   21  6.211         True
2     3   aniket    BE  79.38   19  7.922         True
3     4  ajinkya    TE  72.16   20  7.200         True
4     5     asha    TE  65.78   20  6.562         True
5     6   ayesha    BE  52.05   20  5.189        False
6     7     amar    BE  67.84   19  6.768         True
7     8    amita    BE  70.83   23  7.067         True
8     9     amol    TE  59.25   20  5.909        False
9    10    anmol    BE  81.16   21  8.100         True

In [113]:
x = ['M','M','F','M','M','F','F','F','M','F']

In [114]:
df['gender'] = x
df

   roll     name class  marks  age   cgpa  first_class gender
0     1     anil    TE  59.27   22  5.911        False      M
1     2     amit    TE  62.27   21  6.211         True      M
2     3   aniket    BE  79.38   19  7.922         True      F
3     4  ajinkya    TE  72.16   20  7.200         True      M
4     5     asha    TE  65.78   20  6.562         True      M
5     6   ayesha    BE  52.05   20  5.189        False      F
6     7     amar    BE  67.84   19  6.768         True      F
7     8    amita    BE  70.83   23  7.067         True      F
8     9     amol    TE  59.25   20  5.909        False      M
9    10    anmol    BE  81.16   21  8.100         True      F

In [116]:
ndf = pd.DataFrame({'roll':range(1,11), 'cgpa': df['marks'] / 10 + 0.34, 'gender': ['M','M','F','M','M','F','F','F','M','F']})
ndf

   roll   cgpa gender
0     1  6.267      M
1     2  6.567      M
2     3  8.278      F
3     4  7.556      M
4     5  6.918      M
5     6  5.545      F
6     7  7.124      F
7     8  7.423      F
8     9  6.265      M
9    10  8.456      F

In [117]:
df = pd.read_csv('datasets/student.csv')

In [118]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [119]:
ndf.columns

Index(['roll', 'cgpa', 'gender'], dtype='object')

In [121]:
df.merge(ndf, on='roll')

   roll     name class  marks  age   cgpa gender
0     1     anil    TE  56.77   22  6.267      M
1     2     amit    TE  59.77   21  6.567      M
2     3   aniket    BE  76.88   19  8.278      F
3     4  ajinkya    TE  69.66   20  7.556      M
4     5     asha    TE  63.28   20  6.918      M
5     6   ayesha    BE  49.55   20  5.545      F
6     7     amar    BE  65.34   19  7.124      F
7     8    amita    BE  68.33   23  7.423      F
8     9     amol    TE  56.75   20  6.265      M
9    10    anmol    BE  78.66   21  8.456      F

In [124]:
df5 = pd.read_csv('datasets/student5.csv')
df5

   roll     name class  marks  age
0     1   surbhi    TE  67.44   23
1     2    sujay    TE  74.12   22
2     3  subhash    BE  82.44   21
3     4   sachin    TE  59.33   21
4     5  shalini    TE  63.45   20

In [125]:
pd.concat([df, df5])

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21
0     1   surbhi    TE  67.44   23
1     2    sujay    TE  74.12   22
2     3  subhash    BE  82.44   21
3     4   sachin    TE  59.33   21
4     5  shalini    TE  63.45   20

In [126]:
pd.concat([df, df5], ignore_index=True)

    roll     name class  marks  age
0      1     anil    TE  56.77   22
1      2     amit    TE  59.77   21
2      3   aniket    BE  76.88   19
3      4  ajinkya    TE  69.66   20
4      5     asha    TE  63.28   20
5      6   ayesha    BE  49.55   20
6      7     amar    BE  65.34   19
7      8    amita    BE  68.33   23
8      9     amol    TE  56.75   20
9     10    anmol    BE  78.66   21
10     1   surbhi    TE  67.44   23
11     2    sujay    TE  74.12   22
12     3  subhash    BE  82.44   21
13     4   sachin    TE  59.33   21
14     5  shalini    TE  63.45   20

##### String operation

In [135]:
name = 'Hemant'

In [136]:
name.lower()

'hemant'

In [137]:
name.replace('a','ooop')

'Hemooopnt'

In [138]:
df['name'].str.upper()

0       ANIL
1       AMIT
2     ANIKET
3    AJINKYA
4       ASHA
5     AYESHA
6       AMAR
7      AMITA
8       AMOL
9      ANMOL
Name: name, dtype: object

In [139]:
df['name'].str.title()

0       Anil
1       Amit
2     Aniket
3    Ajinkya
4       Asha
5     Ayesha
6       Amar
7      Amita
8       Amol
9      Anmol
Name: name, dtype: object

In [141]:
df['name'].str.endswith('l')

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8     True
9     True
Name: name, dtype: bool

In [142]:
df['name'].str.startswith('am')

0    False
1     True
2    False
3    False
4    False
5    False
6     True
7     True
8     True
9    False
Name: name, dtype: bool

In [143]:
df['name'].str.replace('i','ee')

0       aneel
1       ameet
2     aneeket
3    ajeenkya
4        asha
5      ayesha
6        amar
7      ameeta
8        amol
9       anmol
Name: name, dtype: object

In [144]:
df['name'].str.isalnum()

0    True
1    True
2    True
3    True
4    True
5    True
6    True
7    True
8    True
9    True
Name: name, dtype: bool

##### Grouping and Aggregation

In [145]:
gr = df.groupby('class')

In [146]:
gr.groups

{'BE': [2, 5, 6, 7, 9], 'TE': [0, 1, 3, 4, 8]}

In [147]:
# Data type of above is dictionary because of key and value

In [148]:
gr.get_group('TE')

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
8     9     amol    TE  56.75   20

In [149]:
gr.min()

       roll     name  marks  age
class
BE        3     amar  49.55   19
TE        1  ajinkya  56.75   20

In [150]:
gr['marks'].max()

class
BE    78.66
TE    69.66
Name: marks, dtype: float64

##### Boolean filter

In [151]:
mask = df['marks'] > 60
df[mask]

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21

In [152]:
df[df['marks'] > 60]

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21

In [153]:
df[df['name'].str.startswith('an')]

   roll    name class  marks  age
0     1    anil    TE  56.77   22
2     3  aniket    BE  76.88   19
9    10   anmol    BE  78.66   21

In [157]:
x = df[(df['marks'] > 60) & (df['class'] == 'BE')]
x

   roll    name class  marks  age
2     3  aniket    BE  76.88   19
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
9    10   anmol    BE  78.66   21

##### Export the data

In [158]:
x.to_csv('datasets/output.csv', index=False)

In [159]:
x.to_html('datasets/output.html', index=False)